from flask_mail import Mail, Message
from datetime import datetime
import os

mail = Mail()

def send_notification_email(subject, recipient_email):
    """
    ฟังก์ชันสำหรับส่งอีเมลแจ้งเตือน (แบบสร้างแรงบันดาลใจ)
    """
    try:
        #ดึงเวลาปัจจุบันมาแสดงผล
        current_time_str = datetime.now().strftime('%H:%M')
        
        msg = Message(
         
            subject=f"ได้เวลาลุยวิชา {subject} แล้ว! 🚀", 
            sender=os.getenv('MAIL_DEFAULT_SENDER'),
            recipients=[recipient_email],
       
            body=f"สวัสดีครับ,\n\n"
                 f"ตั้งสมาธิให้พร้อม! 🧠\n\n"
                 f"ถึงเวลา ( {current_time_str} น.) สำหรับวิชา {subject} ที่คุณตั้งเป้าไว้แล้ว\n\n"
                 f"ความพยายามในวันนี้ สร้างความสำเร็จในวันสอบนะครับ สู้ๆ!"
        )
        
        mail.send(msg)
        print(f"ส่งอีเมล (แบบสร้างแรงบันดาลใจ) สำหรับวิชา {subject} ไปยัง {recipient_email} สำเร็จ")
    
    except Exception as e:
        print(f"เกิดข้อผิดพลาดในการส่งอีเมล: {e}")


